groupmates = [
{
"name": "Вячеслав ",
"surname": "Заздравнов",
"exams": ["Информатика", "ДМ", "ТПР"],
"marks": [4, 5, 4]
},
{
"name": "Михаил",
"surname": "Шелмаков",
"exams": ["История", "АиГ", "ДМ"],
"marks": [3, 3, 3]
},
{
"name": "Иван",
"surname": "Савченков",
"exams": ["Философия", "Физика", "ДМ"],
"marks": [5, 4, 4]
},
{
"name": "Константин",
"surname": "Ливчак",
"exams": ["Информатика", "Физика", "Философия"],
"marks": [5, 5, 5]
},
{
"name": "Радим",
"surname": "Нурмагомедов",
"exams": ["Философия", "Физика", "ДМ"],
"marks": [3, 3, 3]
}
]
